papers/acc16-1.html
---
layout: page
title: ! 'Convex Optimization Based State Estimation against Sparse Integrity Attacks'
comments: true
---
<hr />
<p>
<b>Duo Han, Yilin Mo and Lihua Xie</b>
</p>

<p>
<i>American Control Conference</i>, 2016 
</p>

<p>
Link to the <a href="../../../public/papers/acc16-1.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Facc16-1.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-org2e7f085" class="outline-2">
<h2 id="org2e7f085">Abstract</h2>
<div class="outline-text-2" id="text-org2e7f085">
<p>
We consider the problem of robust estimation in presence of integrity attacks. There are \(m\) sensors monitoring the state and \(p\) of them are under attack. The malicious measurements collected by the compromised sensors can be manipulated arbitrarily by the attacker. The classical estimators such as the least squares estimator may not provide a reliable estimate under the so-called $(p,m)$-sparse attack. In this work, we are not restricting our efforts in studying whether any specific estimator is resilient to the attack or not, but instead we aim to present some generic sufficient and necessary conditions for robustness by considering a general class of convex optimization estimators. The sufficient and necessary conditions are shown to be tight, with a trivial gap. We further specialize our result to scalar sensor measurements case.
</p>
</div>
</div>
